import React, { useEffect, useState } from 'react';
import { Link } from 'react-router-dom';
import avatarImg from '../../../assets/avatar/unnamed.jpg';
import './ProfileDropdown.scss';

const ProfileDropdown = ({ avatar }) => {
  // Состояние для отображения меню
  const [isDropdownOpen, setDropdownOpen] = useState(false);

  // Функция для переключения состояния меню
  const toggleDropdown = () => {
    setDropdownOpen(!isDropdownOpen);
  };

  // Функция для закрытия меню при клике вне компонента
  const closeDropdown = () => {
    setDropdownOpen(false);
  };
  
  useEffect(() => {
    const handleClickOutside = (event) => {
      if (!event.target.closest(".header-nav-right__items-profile")) {
        closeDropdown();
      }
    };
    document.addEventListener("click", handleClickOutside);
    return () => {
      document.removeEventListener("click", handleClickOutside);
    };
  }, []);

  return (
    <div className="header-nav-right__items-profile" onClick={toggleDropdown}>
      <div className="header-nav-right__items-profile__link">
        <div className="header-nav-right__items-profile__avatar">
          <img src={avatarImg} alt="avatar" className="avatar-img" />
        </div>
        <div className="header-nav-right__items-avatar__profileArrow">
          <svg
            fill="none"
            height="8"
            viewBox="0 0 12 8"
            width="12"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              clipRule="evenodd"
              d="M2.16 2.3a.75.75 0 0 1 1.05-.14L6 4.3l2.8-2.15a.75.75 0 1 1 .9 1.19l-3.24 2.5c-.27.2-.65.2-.92 0L2.3 3.35a.75.75 0 0 1-.13-1.05z"
              fill="currentColor"
              fillRule="evenodd"
            />
          </svg>
        </div>
      </div>

      {/* Выпадающее меню */}
      {isDropdownOpen && (
        <div
          className="header-nav-right__items-profile__dropdown"
          onClick={(e) => e.stopPropagation()} // Остановка всплытия события
        >
          <ul className="header-nav-right__items-profile__dropdown-list">
            <li className="header-nav-right__items-profile__dropdown-items">
              <Link to="/profile" className='header-nav-right__items-profile__dropdown-items__link'>
                <div className="header-nav-right__items-profile__dropdown-items__link-icon">
                  <svg class="feather feather-user" fill="none" height="20" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2" viewBox="0 0 24 24" width="20" xmlns="http://www.w3.org/2000/svg"><path d="M20 21v-2a4 4 0 0 0-4-4H8a4 4 0 0 0-4 4v2" /><circle cx="12" cy="7" r="4" /></svg>
                </div>Профиль</Link>
            </li>
            <li className="header-nav-right__items-profile__dropdown-items">
              <Link to="/profile/settings" className='header-nav-right__items-profile__dropdown-items__link'>
                <div className="header-nav-right__items-profile__dropdown-items__link-icon">
                  <svg height="20" id="svg8" version="1.1" viewBox="0 0 8.4666665 8.4666669" width="20" xmlns="http://www.w3.org/2000/svg">
                    <g fill="currentColor" id="layer1" transform="translate(0,-288.53332)">
                      <path  d="m 3.7041666,288.7979 a 0.26460976,0.26460976 0 0 0 -0.2511475,0.18087 l -0.2687174,0.80615 c -0.1084927,0.0382 -0.2146168,0.082 -0.3183269,0.13178 l -0.7601602,-0.37982 a 0.26460976,0.26460976 0 0 0 -0.3054077,0.0496 l -0.7482748,0.74827 a 0.26460976,0.26460976 0 0 0 -0.049609,0.30541 l 0.379305,0.75861 c -0.049895,0.10423 -0.094048,0.21083 -0.1322917,0.31988 l -0.80511879,0.26871 a 0.26460976,0.26460976 0 0 0 -0.18086751,0.25115 v 1.05833 a 0.26460976,0.26460976 0 0 0 0.18086751,0.25115 l 0.80770259,0.26924 c 0.038069,0.10784 0.081782,0.21314 0.1312582,0.31625 l -0.3808553,0.76172 a 0.26460976,0.26460976 0 0 0 0.049609,0.3054 l 0.7482748,0.74879 a 0.26460976,0.26460976 0 0 0 0.3054077,0.0496 l 0.7601602,-0.38033 c 0.1036035,0.0495 0.209454,0.0932 0.3178101,0.13125 l 0.2692342,0.80719 a 0.26460976,0.26460976 0 0 0 0.2511475,0.18087 h 1.0583333 a 0.26460976,0.26460976 0 0 0 0.2511476,-0.18087 l 0.2692341,-0.80874 c 0.1075521,-0.0379 0.2128936,-0.0815 0.3157429,-0.13074 l 0.7622276,0.38137 a 0.26460976,0.26460976 0 0 0 0.3054074,-0.0496 l 0.748275,-0.74879 a 0.26460976,0.26460976 0 0 0 0.049609,-0.3054 l -0.3798218,-0.75965 c 0.049789,-0.10387 0.093561,-0.21018 0.1317749,-0.31884 L 8.0222491,293.548 a 0.26460976,0.26460976 0 0 0 0.1808676,-0.25115 v -1.05833 a 0.26460976,0.26460976 0 0 0 -0.1808676,-0.25115 l -0.806669,-0.26871 c -0.038193,-0.10832 -0.082077,-0.21427 -0.1317747,-0.31781 l 0.3803385,-0.76068 a 0.26460976,0.26460976 0 0 0 -0.049609,-0.30541 l -0.748275,-0.74827 a 0.26460976,0.26460976 0 0 0 -0.3054074,-0.0496 l -0.7580934,0.37878 c -0.1045763,-0.05 -0.2115013,-0.094 -0.3209105,-0.13229 l -0.2682007,-0.8046 a 0.26460976,0.26460976 0 0 0 -0.251148,-0.18088 z m 0.190686,0.52917 h 0.6769613 l 0.245463,0.73691 a 0.26460976,0.26460976 0 0 0 0.1757,0.17001 c 0.1722022,0.0512 0.3388331,0.11967 0.4971272,0.20464 a 0.26460976,0.26460976 0 0 0 0.243396,0.004 l 0.6934978,-0.34675 0.4785236,0.47852 -0.3482991,0.6966 a 0.26460976,0.26460976 0 0 0 0.00362,0.24391 c 0.084769,0.15725 0.1537229,0.32244 0.2051555,0.49351 a 0.26460976,0.26460976 0 0 0 0.1694987,0.17519 l 0.738456,0.24598 v 0.67696 l -0.7379393,0.24598 a 0.26460976,0.26460976 0 0 0 -0.1694987,0.17518 c -0.051373,0.1714 -0.1203285,0.337 -0.2051555,0.49454 a 0.26460976,0.26460976 0 0 0 -0.00362,0.24392 l 0.3477824,0.69556 -0.4785236,0.47904 -0.6981486,-0.34933 a 0.26460976,0.26460976 0 0 0 -0.2439128,0.004 c -0.1566825,0.0843 -0.3210488,0.15287 -0.4914429,0.20412 a 0.26460976,0.26460976 0 0 0 -0.175183,0.1695 l -0.2464967,0.74052 H 3.8948526 l -0.2464967,-0.73949 a 0.26460976,0.26460976 0 0 0 -0.175183,-0.17001 c -0.1710385,-0.0511 -0.3367447,-0.11916 -0.4940265,-0.20361 a 0.26460976,0.26460976 0 0 0 -0.243396,-0.004 l -0.6960816,0.3483 -0.4785238,-0.47904 0.3488159,-0.69763 a 0.26460976,0.26460976 0 0 0 -0.00362,-0.24391 c -0.08452,-0.15682 -0.1532676,-0.32191 -0.2046387,-0.49248 a 0.26460976,0.26460976 0 0 0 -0.1694987,-0.17467 l -0.73948973,-0.24649 v -0.67696 l 0.73742263,-0.24598 a 0.26460976,0.26460976 0 0 0 0.1700155,-0.17519 c 0.051313,-0.17172 0.1197532,-0.33773 0.2046387,-0.49557 a 0.26460976,0.26460976 0 0 0 0.00362,-0.24392 l -0.3472656,-0.69453 0.4785238,-0.47852 0.6960816,0.34778 a 0.26460976,0.26460976 0 0 0 0.2439127,-0.004 c 0.1573948,-0.0848 0.3227911,-0.15375 0.4940266,-0.20515 a 0.26460976,0.26460976 0 0 0 0.1751832,-0.1695 z" />
                      <path d="m 4.2324219,290.91406 c -1.0197435,0 -1.8515625,0.83377 -1.8515625,1.85352 0,1.01974 0.831819,1.85156 1.8515625,1.85156 1.0197434,0 1.8535156,-0.83182 1.8535156,-1.85156 0,-1.01975 -0.8337722,-1.85352 -1.8535156,-1.85352 z m 0,0.5293 c 0.7337606,0 1.3242187,0.59046 1.3242187,1.32422 0,0.73376 -0.5904581,1.32226 -1.3242187,1.32226 -0.7337606,0 -1.3222657,-0.5885 -1.3222657,-1.32226 0,-0.73376 0.5885051,-1.32422 1.3222657,-1.32422 z" />
                    </g>
                  </svg>
                </div>
                Настройки
              </Link>
            </li>
            <li className="header-nav-right__items-profile__dropdown-items">
              <Link to="/profile/theme" className='header-nav-right__items-profile__dropdown-items__link'>
                <div className="header-nav-right__items-profile__dropdown-items__link-icon">
                  <svg fill="none" height="20" viewBox="0 0 24 24" width="20" xmlns="http://www.w3.org/2000/svg"><path clip-rule="evenodd" d="M10.6338 0.90947C11.4028 0.189743 12.5981 0.189742 13.3671 0.90947L15.6927 3.0861L18.8763 3.19143C19.9289 3.22625 20.7742 4.07152 20.809 5.1242L20.9144 8.30774L23.091 10.6333C23.8107 11.4023 23.8107 12.5977 23.091 13.3667L20.9144 15.6923L20.809 18.8758C20.7742 19.9285 19.9289 20.7738 18.8763 20.8086L15.6927 20.9139L13.3671 23.0905C12.5981 23.8103 11.4028 23.8103 10.6338 23.0905L8.30819 20.9139L5.12464 20.8086C4.07197 20.7738 3.2267 19.9285 3.19187 18.8758L3.08654 15.6923L0.909913 13.3667C0.190186 12.5977 0.190185 11.4023 0.909912 10.6333L3.08654 8.30774L3.19187 5.1242C3.2267 4.07152 4.07196 3.22625 5.12464 3.19143L8.30819 3.0861L10.6338 0.90947ZM14.326 4.5463L12.0004 2.36967L9.67486 4.5463C9.32095 4.87754 8.85879 5.06897 8.37432 5.085L5.19077 5.19033L5.08545 8.37388C5.06942 8.85835 4.87798 9.32051 4.54674 9.67442L2.37012 12L4.54674 14.3256C4.87798 14.6795 5.06942 15.1417 5.08545 15.6261L5.19077 18.8097L8.37432 18.915C8.85879 18.931 9.32095 19.1225 9.67486 19.4537L12.0004 21.6303L14.326 19.4537C14.6799 19.1225 15.1421 18.931 15.6266 18.915L18.8101 18.8097L18.9154 15.6261C18.9315 15.1417 19.1229 14.6795 19.4541 14.3256L21.6308 12L19.4541 9.67442C19.1229 9.32051 18.9315 8.85835 18.9154 8.37388L18.8101 5.19033L15.6266 5.085C15.1421 5.06897 14.6799 4.87754 14.326 4.5463Z" fill="currentColor" fill-rule="evenodd" /><path clip-rule="evenodd" d="M11.3997 7.00098C12.6953 8.27087 13.5 10.041 13.5 12C13.5 13.959 12.6953 15.7291 11.3997 16.999C11.4331 16.9997 11.4665 17 11.5 17C14.2614 17 16.5 14.7614 16.5 12C16.5 9.23858 14.2614 7 11.5 7C11.4665 7 11.4331 7.00033 11.3997 7.00098ZM8.58287 5.6352C9.47214 5.22705 10.4609 5 11.5 5C15.366 5 18.5 8.13401 18.5 12C18.5 15.866 15.366 19 11.5 19C10.4609 19 9.47214 18.773 8.58287 18.3648C8.22768 18.2018 8 17.8468 8 17.456C8 17.0651 8.22768 16.7101 8.58287 16.5471C10.3064 15.7561 11.5 14.0164 11.5 12C11.5 9.98362 10.3064 8.24392 8.58287 7.45289C8.22768 7.28987 8 6.93486 8 6.54404C8 6.15322 8.22768 5.79822 8.58287 5.6352Z" fill="currentColor" fill-rule="evenodd" /></svg>
                </div>Тема</Link>
            </li>
            <li className="header-nav-right__items-profile__dropdown-items">
              <Link to="/auth/logout" className='header-nav-right__items-profile__dropdown-items__link'>
                <div className="header-nav-right__items-profile__dropdown-items__link-icon">
                  <svg fill="none" height="20" viewBox="0 0 24 24" width="20" xmlns="http://www.w3.org/2000/svg"><path d="M15 3H7C5.89543 3 5 3.89543 5 5V19C5 20.1046 5.89543 21 7 21H15" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2" /><path fill="currentColor" d="M19 12L15 8M19 12L15 16M19 12H9" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2" /></svg>
                </div>Выход</Link>
            </li>
          </ul>
        </div>
      )}
    </div>
  );
};

export default ProfileDropdown;
